Feature: Класиране на дете

  Scenario Outline: Класиране на дете
    Given Отваряме екрана за класиране на дете
    And Попълваме информация за детето има брат или сестра: "<sibling>"
    When Попълваме информация за детето има увреждане: "<impaired>"
    And  Попълваме информация за детето има близнак: "<twin>"
    And Попълваме информация за родител на детето работи: "<worker>"
    And Натискаме бутона за класиране на детето в системата
    Then Получаваме съобщение: "<expectedMessage>"
    Examples:
      | sibling | impaired | twin |worker| expectedMessage |
      |true|true|true|true|Детето ви има максимален брой точки и ще бъде класирано|
      |true|true|true|false|Детето ви има висок шанс да се класира|
      |false|true|true|true|Детето ви има среден брой точки и ще се класира на случаен принцип |
      |false|true|false|false|Детето ви има малък шанс да се класира |
      |false|false|false|false|Детето има 0 бонус точки и най-вероятно няма да се класира|
      |null |null |null |null |Детето има 0 бонус точки и най-вероятно няма да се класира                      |