Feature: Регистриране на дете

  Scenario Outline: Регистриране на дете
    Given Отваряме екрана за регистрация на дете
    When Въвеждаме дали детето има увреждане: "<isImpaired>"
    And Въвеждаме дали детето има брат или сестра: "<hasSibling>"
    And  Въвеждаме дали детето има близнак: "<isTwin>"
    And Въвеждаме родителя на детето: "<parent>"
    And Натискаме бутона за регистрация на детето в системата
    Then Получаваме съобщение: "<message>"
    Examples:
    | isImpaired | hasSibling | isTwin |parent| message       |
    |true|true|true|gosho|Успешно регистрирано дете за класиране                                 |
    |false|false|true|gosho|Няма как детето да няма брат или сестра и в същото време да има близнак|
    |null|true|true|gosho|Не е казано дали детето е с увреждане                                  |
    |true|null|false|gosho|Не е казано дали детето има брат или сестра в учебното заведение       |
    |true|true|null|gosho|Не е казано дали детето има близнак                                    |